**Tuple: is an ordered Immutable collection of items**
* we use () to denote tuple

In [ ]:
numbers=(100,130,100,230,400,500,100)

In [ ]:
print('Number of items in tuple are: ',len(numbers))

Number of items in tuple are:  7

In [ ]:
print('All Items in tuple')
for item in numbers:
    print(item,end='\t')

All Items in tuple
100	130	100	230	400	500	100

In [ ]:
for (i,num) in enumerate(numbers):
    print(f'{i}->{num}')

0->100
1->130
2->100
3->230
4->400
5->500
6->100

In [ ]:
# A collection of employees using touple(id,name,salary,designation)
employees=(
    (1,'Sam',5500,'Manager'),
    (2,'Raj',4200,'Developer'),
    (3,'Ravi',3500,'Developer'),
    (4,'Amit',3500,'Developer'),
    (5,'Vini',2500,'Tester'),
    (6,'Deep',5500,'Hr'),
    (7,'Rohan',2600,'Tester'),
)

In [ ]:
for emp in employees:
    print(emp)

(1, 'Sam', 5500, 'Manager')
(2, 'Raj', 4200, 'Developer')
(3, 'Ravi', 3500, 'Developer')
(4, 'Amit', 3500, 'Developer')
(5, 'Vini', 2500, 'Tester')
(6, 'Deep', 5500, 'Hr')
(7, 'Rohan', 2600, 'Tester')

In [ ]:
for emp in employees:
    print(f'ID:{emp[0]} \t Name: {emp[1]} \t Salary: {emp[2]} \t Designation: {emp[3]}')

ID:1 	 Name: Sam 	 Salary: 5500 	 Designation: Manager
ID:2 	 Name: Raj 	 Salary: 4200 	 Designation: Developer
ID:3 	 Name: Ravi 	 Salary: 3500 	 Designation: Developer
ID:4 	 Name: Amit 	 Salary: 3500 	 Designation: Developer
ID:5 	 Name: Vini 	 Salary: 2500 	 Designation: Tester
ID:6 	 Name: Deep 	 Salary: 5500 	 Designation: Hr
ID:7 	 Name: Rohan 	 Salary: 2600 	 Designation: Tester

**Exercise-01 Day-02**

---
* Wrtie a BankTransactions Record using Tuple,Do the following

1.   Saved 3 Transaction
2.   Transaction Content: TranscationID,Name,Amount,Date,Type
 *  e.g. TXN-001,Sam,3500.45,'2025-11-25','Phone Banking'
 3. Show Stored Data

In [1]:
bank_trans=(
    ('TXN-001','Sam',3500.45,'2025-11-25','Phone Banking'),
    ('TXN-113','Vi',2000.45,'2025-09-13','Debit Card'),
    ('TXN-1125','Anil',5000.45,'2025-10-25','Credit Card')
)

In [3]:
for tr in bank_trans:
    print(f'\n Transcation ID:{tr[0]} \t Name: {tr[1]} \t Amount: {tr[2]} \t Date: {tr[3]} \t Type: {tr[4]}')

 Transcation ID:TXN-001 	 Name: Sam 	 Amount: 3500.45 	 Date: 2025-11-25 	 Type: Phone Banking

 Transcation ID:TXN-113 	 Name: Vi 	 Amount: 2000.45 	 Date: 2025-09-13 	 Type: Debit Card

 Transcation ID:TXN-1125 	 Name: Anil 	 Amount: 5000.45 	 Date: 2025-10-25 	 Type: Credit Card

In [4]:
bank_trans[0][0]

'TXN-001'

In [6]:
for tr in bank_trans:
  tr_id=tr[0]
  tr_name=tr[1]
  tr_amount=tr[2]
  tr_date=tr[3]
  tr_type=tr[4]
  print(tr_name)

Sam
Vi
Anil

In [9]:
print(bank_trans[0][1])

Sam